# Intro to Jupyter Notebook

## Hello world

In [1]:
print('Hello world')

Hello world

## Creating a variable

In [2]:
x = 2

# Intro to Pandas

## Importing the library

In [3]:
import pandas as pd

## Pandas series
### Creating a series

In [4]:
flower_list = ['Sunflower', 'Orchid', 'Cup milk', 'Lily', 'Rose', 'Violet']
flower_series = pd.Series(flower_list)
flower_series.name = 'Flowers'
flower_series

0    Sunflower
1       Orchid
2     Cup milk
3         Lily
4         Rose
5       Violet
Name: Flowers, dtype: object

## Pandas dataframe

### Creating a list

In [5]:
pizza_list = [['Margherita', 'Y', 22.0], ['Pepperoni', 'N', 27.0], ['Ham and cheese', 'N', 20.0], [], ['Hawaiian', 'N', 25.0]]
pizza_list.append(['Four cheese', 'Y', 27.0])
pizza_list.append(['', '', ''])
pizza_list.append(['Mushroom', 'Y', 25.0])
pizza_list

[['Margherita', 'Y', 22.0],
 ['Pepperoni', 'N', 27.0],
 ['Ham and cheese', 'N', 20.0],
 [],
 ['Hawaiian', 'N', 25.0],
 ['Four cheese', 'Y', 27.0],
 ['', '', ''],
 ['Mushroom', 'Y', 25.0]]

### Turning the list into a dataframe

In [6]:
pizza_dataframe = pd.DataFrame(pizza_list)
pizza_dataframe

                0     1     2
0      Margherita     Y  22.0
1       Pepperoni     N  27.0
2  Ham and cheese     N  20.0
3            None  None  None
4        Hawaiian     N  25.0
5     Four cheese     Y  27.0
6
7        Mushroom     Y  25.0

### Adding names to the columns

In [7]:
pizza_dataframe.columns = ['Flavor', 'Is it vegetarian?', 'Price']
pizza_dataframe

           Flavor Is it vegetarian? Price
0      Margherita                 Y  22.0
1       Pepperoni                 N  27.0
2  Ham and cheese                 N  20.0
3            None              None  None
4        Hawaiian                 N  25.0
5     Four cheese                 Y  27.0
6
7        Mushroom                 Y  25.0

# Showing the dataframe info

## Head

.head(n) shows the first n data

In [8]:
pizza_dataframe.head(3)

           Flavor Is it vegetarian? Price
0      Margherita                 Y  22.0
1       Pepperoni                 N  27.0
2  Ham and cheese                 N  20.0

## Tail

.tail(n) shows the last n data

In [9]:
pizza_dataframe.tail(3)

        Flavor Is it vegetarian? Price
5  Four cheese                 Y  27.0
6
7     Mushroom                 Y  25.0

## Shape

.shape shows the number of columns and rows

In [10]:
pizza_dataframe.shape

(8, 3)

## Info

.info() shows a compilation of the dataframe information

In [11]:
pizza_dataframe.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 3 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Flavor             7 non-null      object
 1   Is it vegetarian?  7 non-null      object
 2   Price              7 non-null      object
dtypes: object(3)
memory usage: 320.0+ bytes

## OBS

The null value refers to the line of index 3, that displays 'None'

```
['', ''] is not the same as []
```
['',''] is a list with string values, but with no characters

[] is an empty list

# Slicing and dicing the dataframe

## Selecting a column

In [12]:
pizza_dataframe['Price']

0    22.0
1    27.0
2    20.0
3    None
4    25.0
5    27.0
6
7    25.0
Name: Price, dtype: object

## Selecting multiple columns

In [13]:
pizza_dataframe[['Price', 'Flavor']]

  Price          Flavor
0  22.0      Margherita
1  27.0       Pepperoni
2  20.0  Ham and cheese
3  None            None
4  25.0        Hawaiian
5  27.0     Four cheese
6
7  25.0        Mushroom

## Selecting a specific location inside the dataframe

In [14]:
print(pizza_dataframe.iloc[0,0])
print(pizza_dataframe.iloc[5,2])

Margherita
27.0

## Selecting a range inside the dataframe

### Index location: .iloc() - Uses indexes to set ranges of data

#### Restricting both the columns and rows

In [15]:
pizza_dataframe.iloc[2:5, 0:2]

           Flavor Is it vegetarian?
2  Ham and cheese                 N
3            None              None
4        Hawaiian                 N

In [16]:
pizza_dataframe.iloc[2:5, [0,2]]

           Flavor Price
2  Ham and cheese  20.0
3            None  None
4        Hawaiian  25.0

#### Restricting only the columns

In [17]:
pizza_dataframe.iloc[:, 0:2]

           Flavor Is it vegetarian?
0      Margherita                 Y
1       Pepperoni                 N
2  Ham and cheese                 N
3            None              None
4        Hawaiian                 N
5     Four cheese                 Y
6
7        Mushroom                 Y

#### Restricting only the rows

In [18]:
pizza_dataframe.iloc[1:4, :]

           Flavor Is it vegetarian? Price
1       Pepperoni                 N  27.0
2  Ham and cheese                 N  20.0
3            None              None  None

#### With no restrictions

In [19]:
pizza_dataframe.iloc[:,:]

           Flavor Is it vegetarian? Price
0      Margherita                 Y  22.0
1       Pepperoni                 N  27.0
2  Ham and cheese                 N  20.0
3            None              None  None
4        Hawaiian                 N  25.0
5     Four cheese                 Y  27.0
6
7        Mushroom                 Y  25.0

### Location: .loc() - Uses indexes and columns names to set ranges of data

#### Selecting all the rows and restricting to the column 'Flavor'

In [20]:
pizza_dataframe.loc[:, 'Flavor']

0        Margherita
1         Pepperoni
2    Ham and cheese
3              None
4          Hawaiian
5       Four cheese
6
7          Mushroom
Name: Flavor, dtype: object

#### Restricting the rows and restricting to the column 'Flavor'

In [21]:
pizza_dataframe.loc[3:7, 'Flavor']

3           None
4       Hawaiian
5    Four cheese
6
7       Mushroom
Name: Flavor, dtype: object

#### Restricting the rows and restricting to the columns 'Price' and 'Flavor'

In [22]:
pizza_dataframe.loc[3:7, ['Price', 'Flavor']]

  Price       Flavor
3  None         None
4  25.0     Hawaiian
5  27.0  Four cheese
6
7  25.0     Mushroom

# Dealing with .csv files

## Importing the file

In [23]:
airports_df = pd.read_csv('./data/airports.csv')
airports_df

             Name        City         Country
0  Seattle-Tacoma     Seattle             USA
1          Dulles  Washington             USA
2        Heathrow      London  United Kingdom
3        Schiphol   Amsterdam     Netherlands
4          Changi   Singapore       Singapore
5         Pearson     Toronto          Canada
6          Narita       Tokyo           Japan

## Skipping rows with errors

In [24]:
airports_df_invalid_row = pd.read_csv('./data/airports_invalid_row.csv', on_bad_lines = 'skip')
airports_df_invalid_row

  Seattle-Tacoma     Seattle          USA
0         Dulles  Washington          USA
1       Schiphol   Amsterdam  Netherlands
2         Changi   Singapore    Singapore
3        Pearson     Toronto       Canada
4         Narita       Tokyo        Japan

## Dealing with files without header

#### Using indexes for the columns

In [25]:
airports_df_no_header = pd.read_csv('./data/airports_no_header.csv', header = None)
airports_df_no_header

                0           1               2
0  Seattle-Tacoma     Seattle             USA
1          Dulles  Washington             USA
2        Heathrow      London  United Kingdom
3        Schiphol   Amsterdam     Netherlands
4          Changi   Singapore       Singapore
5         Pearson     Toronto          Canada
6          Narita       Tokyo           Japan

#### Adding the columns name during the importation

In [26]:
airports_df_with_header = pd.read_csv('./data/airports_no_header.csv', header = None, names=['Airport', 'City', 'Country'])
airports_df_with_header

          Airport        City         Country
0  Seattle-Tacoma     Seattle             USA
1          Dulles  Washington             USA
2        Heathrow      London  United Kingdom
3        Schiphol   Amsterdam     Netherlands
4          Changi   Singapore       Singapore
5         Pearson     Toronto          Canada
6          Narita       Tokyo           Japan

## Missing values: NaN

In [27]:
airports_df_nan = pd.read_csv('./data/airports_nan.csv')
airports_df_nan

             Name        City         Country
0  Seattle-Tacoma     Seattle             USA
1          Dulles  Washington             USA
2        Heathrow      London  United Kingdom
3        Schiphol   Amsterdam     Netherlands
4          Changi         NaN       Singapore
5         Pearson     Toronto          Canada
6          Narita       Tokyo           Japan

## Exporting a dataframe as .csv

### Exporting the dataframe with the index

In [28]:
airports_df_with_header.to_csv('./data/airports_with_header.csv')

### Exporting the dataframe without the index

In [29]:
airports_df_with_header.to_csv('./data/airports_with_header_no_index.csv', index = False)

# Transforming the data

## Removing column

### Creating a new dataframe without a column of the original dataframe

In [35]:
flight_df = pd.read_csv('./data/flight_delays.csv')
flight_df.head()

,FL_DATE,OP_UNIQUE_CARRIER,TAIL_NUM,OP_CARRIER_FL_NUM,ORIGIN,DEST,CRS_DEP_TIME,DEP_TIME,DEP_DELAY,CRS_ARR_TIME,ARR_TIME,ARR_DELAY,CRS_ELAPSED_TIME,ACTUAL_ELAPSED_TIME,AIR_TIME,DISTANCE
0,2018-10-01,WN,N221WN,802,ABQ,BWI,905,903,-2,1450,1433,-17,225,210,197,1670
1,2018-10-01,WN,N8329B,3744,ABQ,BWI,1500,1458,-2,2045,2020,-25,225,202,191,1670
2,2018-10-01,WN,N920WN,1019,ABQ,DAL,1800,1802,2,2045,2032,-13,105,90,80,580
3,2018-10-01,WN,N480WN,1499,ABQ,DAL,950,947,-3,1235,1223,-12,105,96,81,580
4,2018-10-01,WN,N227WN,3635,ABQ,DAL,1150,1151,1,1430,1423,-7,100,92,80,580

In [31]:
clean_flight_df = flight_df.drop(columns = ['ARR_TIME'])
clean_flight_df.head()

,FL_DATE,OP_UNIQUE_CARRIER,TAIL_NUM,OP_CARRIER_FL_NUM,ORIGIN,DEST,CRS_DEP_TIME,DEP_TIME,DEP_DELAY,CRS_ARR_TIME,ARR_DELAY,CRS_ELAPSED_TIME,ACTUAL_ELAPSED_TIME,AIR_TIME,DISTANCE
0,2018-10-01,WN,N221WN,802,ABQ,BWI,905,903,-2,1450,-17,225,210,197,1670
1,2018-10-01,WN,N8329B,3744,ABQ,BWI,1500,1458,-2,2045,-25,225,202,191,1670
2,2018-10-01,WN,N920WN,1019,ABQ,DAL,1800,1802,2,2045,-13,105,90,80,580
3,2018-10-01,WN,N480WN,1499,ABQ,DAL,950,947,-3,1235,-12,105,96,81,580
4,2018-10-01,WN,N227WN,3635,ABQ,DAL,1150,1151,1,1430,-7,100,92,80,580

### Removing the column from the original dataframe

In [36]:
flight_df.drop(columns = ['ARR_TIME'], inplace = True)
flight_df.head()

,FL_DATE,OP_UNIQUE_CARRIER,TAIL_NUM,OP_CARRIER_FL_NUM,ORIGIN,DEST,CRS_DEP_TIME,DEP_TIME,DEP_DELAY,CRS_ARR_TIME,ARR_DELAY,CRS_ELAPSED_TIME,ACTUAL_ELAPSED_TIME,AIR_TIME,DISTANCE
0,2018-10-01,WN,N221WN,802,ABQ,BWI,905,903,-2,1450,-17,225,210,197,1670
1,2018-10-01,WN,N8329B,3744,ABQ,BWI,1500,1458,-2,2045,-25,225,202,191,1670
2,2018-10-01,WN,N920WN,1019,ABQ,DAL,1800,1802,2,2045,-13,105,90,80,580
3,2018-10-01,WN,N480WN,1499,ABQ,DAL,950,947,-3,1235,-12,105,96,81,580
4,2018-10-01,WN,N227WN,3635,ABQ,DAL,1150,1151,1,1430,-7,100,92,80,580

## Splitting data

In [39]:
descriptive = ['ORIGIN', 'DEST', 'OP_CARRIER_FL_NUM', 'OP_UNIQUE_CARRIER', 'TAIL_NUM']
qualitative_df = flight_df.loc[:, descriptive]
qualitative_df.head()

  ORIGIN DEST  OP_CARRIER_FL_NUM OP_UNIQUE_CARRIER TAIL_NUM
0    ABQ  BWI                802                WN   N221WN
1    ABQ  BWI               3744                WN   N8329B
2    ABQ  DAL               1019                WN   N920WN
3    ABQ  DAL               1499                WN   N480WN
4    ABQ  DAL               3635                WN   N227WN

## Handling missing values

In [59]:
delays_df = pd.read_csv('./data/lots_of_flight_data.csv')
delays_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 300000 entries, 0 to 299999
Data columns (total 16 columns):
 #   Column               Non-Null Count   Dtype
---  ------               --------------   -----
 0   FL_DATE              300000 non-null  object
 1   OP_UNIQUE_CARRIER    300000 non-null  object
 2   TAIL_NUM             299660 non-null  object
 3   OP_CARRIER_FL_NUM    300000 non-null  int64
 4   ORIGIN               300000 non-null  object
 5   DEST                 300000 non-null  object
 6   CRS_DEP_TIME         300000 non-null  int64
 7   DEP_TIME             296825 non-null  float64
 8   DEP_DELAY            296825 non-null  float64
 9   CRS_ARR_TIME         300000 non-null  int64
 10  ARR_TIME             296574 non-null  float64
 11  ARR_DELAY            295832 non-null  float64
 12  CRS_ELAPSED_TIME     300000 non-null  int64
 13  ACTUAL_ELAPSED_TIME  295832 non-null  float64
 14  AIR_TIME             295832 non-null  float64
 15  DISTANCE             300000 non-null  int64
dtypes: float64(6), int64(5), object(5)
memory usage: 36.6+ MB

### Creating a new dataframe without the NaN values

In [60]:
delays_no_nan_df = delays_df.dropna()
delays_no_nan_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 295832 entries, 0 to 299999
Data columns (total 16 columns):
 #   Column               Non-Null Count   Dtype
---  ------               --------------   -----
 0   FL_DATE              295832 non-null  object
 1   OP_UNIQUE_CARRIER    295832 non-null  object
 2   TAIL_NUM             295832 non-null  object
 3   OP_CARRIER_FL_NUM    295832 non-null  int64
 4   ORIGIN               295832 non-null  object
 5   DEST                 295832 non-null  object
 6   CRS_DEP_TIME         295832 non-null  int64
 7   DEP_TIME             295832 non-null  float64
 8   DEP_DELAY            295832 non-null  float64
 9   CRS_ARR_TIME         295832 non-null  int64
 10  ARR_TIME             295832 non-null  float64
 11  ARR_DELAY            295832 non-null  float64
 12  CRS_ELAPSED_TIME     295832 non-null  int64
 13  ACTUAL_ELAPSED_TIME  295832 non-null  float64
 14  AIR_TIME             295832 non-null  float64
 15  DISTANCE             295832 non-null  int64
dtypes: float64(6), int64(5), object(5)
memory usage: 38.4+ MB

### Removing the NaN values from the original dataframe

In [61]:
delays_df.dropna(inplace = True)
delays_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 295832 entries, 0 to 299999
Data columns (total 16 columns):
 #   Column               Non-Null Count   Dtype
---  ------               --------------   -----
 0   FL_DATE              295832 non-null  object
 1   OP_UNIQUE_CARRIER    295832 non-null  object
 2   TAIL_NUM             295832 non-null  object
 3   OP_CARRIER_FL_NUM    295832 non-null  int64
 4   ORIGIN               295832 non-null  object
 5   DEST                 295832 non-null  object
 6   CRS_DEP_TIME         295832 non-null  int64
 7   DEP_TIME             295832 non-null  float64
 8   DEP_DELAY            295832 non-null  float64
 9   CRS_ARR_TIME         295832 non-null  int64
 10  ARR_TIME             295832 non-null  float64
 11  ARR_DELAY            295832 non-null  float64
 12  CRS_ELAPSED_TIME     295832 non-null  int64
 13  ACTUAL_ELAPSED_TIME  295832 non-null  float64
 14  AIR_TIME             295832 non-null  float64
 15  DISTANCE             295832 non-null  int64
dtypes: float64(6), int64(5), object(5)
memory usage: 38.4+ MB

## Handling duplicated data

### Showing the duplicated rows

In [74]:
airports_duplicated_df = pd.read_csv('./data/airports_duplicated.csv')
airports_duplicated_df.duplicated()

0    False
1    False
2    False
3     True
4    False
5    False
6    False
7    False
dtype: bool

### Creating a new dataframe without the duplicated values

In [75]:
airports_no_duplicates_df = airports_duplicated_df.drop_duplicates()
airports_no_duplicates_df

             Name        City         Country
0  Seattle-Tacoma     Seattle             USA
1          Dulles  Washington             USA
2        Heathrow      London  United Kingdom
4        Schiphol   Amsterdam     Netherlands
5          Changi   Singapore       Singapore
6         Pearson     Toronto          Canada
7          Narita       Tokyo           Japan

### Removing the duplicates from the original dataframe

In [76]:
airports_duplicated_df.drop_duplicates(inplace = True)
airports_duplicated_df

             Name        City         Country
0  Seattle-Tacoma     Seattle             USA
1          Dulles  Washington             USA
2        Heathrow      London  United Kingdom
4        Schiphol   Amsterdam     Netherlands
5          Changi   Singapore       Singapore
6         Pearson     Toronto          Canada
7          Narita       Tokyo           Japan